py32-rs/py32-data/svd/PY32F040Exx.svd
        <register>
          <name>CCR4</name>
          <description>desc CCR4</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR4</name>
          <description>desc CNDTR4</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR4</name>
          <description>desc CPAR4</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR4</name>
          <description>desc CMAR4</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR5</name>
          <description>desc CCR5</description>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR5</name>
          <description>desc CNDTR5</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR5</name>
          <description>desc CPAR5</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR5</name>
          <description>desc CMAR5</description>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR6</name>
          <description>desc CCR6</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR6</name>
          <description>desc CNDTR6</description>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR6</name>
          <description>desc CPAR6</description>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR6</name>
          <description>desc CMAR6</description>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR7</name>
          <description>desc CCR7</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR7</name>
          <description>desc CNDTR7</description>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR7</name>
          <description>desc CPAR7</description>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR7</name>
          <description>desc CMAR7</description>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
