py32-rs/py32-data/svd/PY32F040Exx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global Interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CPHA</name>
              <description>desc CPHA</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>desc CPOL</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSTR</name>
              <description>desc MSTR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR</name>
              <description>desc BR</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SPE</name>
              <description>desc SPE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>desc LSBFIRST</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI</name>
              <description>desc SSI</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSM</name>
              <description>desc SSM</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXONLY</name>
              <description>desc RXONLY</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DDF</name>
              <description>desc DDF</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CRCNEXT</name>
              <description>desc CRCNEXT</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <description>desc CRCEN</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BIDIOE</name>
              <description>desc BIDIOE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BIDIMODE</name>
              <description>desc BIDIMODE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RXDMAEN</name>
              <description>desc RXDMAEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>desc TXDMAEN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSOE</name>
              <description>desc SSOE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRTXFIFO</name>
              <description>desc CLRTXFIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>desc RXNEIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>desc TXEIE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FRXTH</name>
              <description>desc FRXTH</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LDMA_RX</name>
              <description>desc LDMA_RX</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LDMA_TX</name>
              <description>desc LDMA_TX</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHSIDE</name>
              <description>desc CHSIDE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UDR</name>
              <description>desc UDR</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>desc CRCERR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MODF</name>
              <description>desc MODF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>desc OVR</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>desc BSY</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRLVL</name>
              <description>desc FRLVL</description>
              <bitRange>[10:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FTLVL</name>
              <description>desc FTLVL</description>
              <bitRange>[12:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPR</name>
          <description>desc CRCPR</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>desc CRCPOLY</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRCR</name>
          <description>desc RXCRCR</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>desc RXCRC</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRCR</name>
          <description>desc TXCRCR</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXCRC</name>
              <description>desc TXCRC</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCFGR</name>
          <description>desc I2SCFGR</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CHLEN</name>
              <description>desc CHLEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATLEN</name>
              <description>desc DATLEN</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>CKPOL</name>
              <description>desc CKPOL</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2SSTD</name>
              <description>desc I2SSTD</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PCMSYNC</name>
              <description>desc PCMSYNC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2SCFG</name>
              <description>desc I2SCFG</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2SE</name>
              <description>desc I2SE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2SMOD</name>
              <description>desc I2SMOD</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SPR</name>
          <description>desc I2SPR</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>I2SDIV</name>
              <description>desc I2SDIV</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ODD</name>
              <description>desc ODD</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MCKOE</name>
              <description>desc MCKOE</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
